{
    "token_to_id": {
        "<PAD>": 0,
        "<SOS>": 1,
        "<EOS>": 2,
        "<UNK>": 3,
        "S": 4,
        "i": 5,
        "n": 6,
        "\\angle": 7,
        "C": 8,
        "D": 9,
        "B": 10,
        "=": 11,
        "\\sin": 12,
        "E": 13,
        "A": 14,
        "2": 15,
        "4": 16,
        "6": 17,
        "3": 18,
        "7": 19,
        "-": 20,
        "5": 21,
        "m": 22,
        "\\vert": 23,
        "\\textcircled": 24,
        "{": 25,
        "}": 26,
        "x": 27,
        "\\cdot": 28,
        "\\frac": 29,
        "1": 30,
        "0": 31,
        ".": 32,
        "\\Delta": 33,
        "\\cong": 34,
        "(": 35,
        ")": 36,
        ",": 37,
        "8": 38,
        "+": 39,
        "\u3001": 40,
        ">": 41,
        "y": 42,
        "_": 43,
        "9": 44,
        "W": 45,
        "P": 46,
        "t": 47,
        "s": 48,
        "J": 49,
        "^": 50,
        "\\sqrt": 51,
        "\\overline": 52,
        "F": 53,
        "N": 54,
        "\\times": 55,
        "a": 56,
        "\\div": 57,
        "k": 58,
        "g": 59,
        "b": 60,
        "c": 61,
        "M": 62,
        "[": 63,
        "]": 64,
        "<": 65,
        "\\": 66,
        "%": 67,
        "O": 68,
        "\\tan": 69,
        "\\dot": 70,
        "\\cos": 71,
        "\\alpha": 72,
        "\\circ": 73,
        "\\boxed": 74,
        "\\therefore": 75,
        "\\pi": 76,
        "\\cdots": 77,
        "\\leq": 78,
        "\\varphi": 79,
        "\\pm": 80,
        "\\Rightarrow": 81,
        "\\in": 82,
        "G": 83,
        "\\geq": 84,
        "\\rho": 85,
        "V": 86,
        "/": 87,
        "\\bot": 88,
        ":": 89,
        "\\square": 90,
        "Q": 91,
        "h": 92,
        "\\arcsin": 93,
        "\\beta": 94,
        "w": 95,
        "\\overrightarrow": 96,
        "U": 97,
        "u": 98,
        "\\xlongequal": 99,
        "\\uparrow": 100,
        "\\because": 101,
        ";": 102,
        "r": 103,
        "R": 104,
        "I": 105,
        "\\Omega": 106,
        "q": 107,
        "\\prime": 108,
        "\\theta": 109,
        "\\ast": 110,
        "H": 111,
        "f": 112,
        "e": 113,
        "v": 114,
        "d": 115,
        "L": 116,
        "\\widehat": 117,
        "\\approx": 118,
        "K": 119,
        "o": 120,
        "\\min": 121,
        "\\ln": 122,
        "l": 123,
        "\\infty": 124,
        "T": 125,
        "X": 126,
        "\\max": 127,
        "\\rightarrow": 128,
        "p": 129,
        "\\lambda": 130,
        "\\rightleftharpoons": 131,
        "\\arccos": 132,
        "\u3002": 133,
        "\\geqslant": 134,
        "Z": 135,
        "z": 136,
        "\\downarrow": 137,
        "\\cot": 138,
        "\\neq": 139,
        "\u6216": 140,
        "\\int": 141,
        "\\sim": 142,
        "\\log": 143,
        "\u6c42": 144,
        "\u548c": 145,
        "\\lim": 146,
        "\u884c": 147,
        "\u4e2a": 148,
        "!": 149,
        "j": 150,
        "\\arctan": 151,
        "\\mu": 152,
        "\\varepsilon": 153,
        "\\cap": 154,
        "Y": 155,
        "\\equiv": 156,
        "\\partial": 157,
        "\\lg": 158,
        "?": 159,
        "\\Lambda": 160,
        "\\xrightarrow": 161,
        "\\cup": 162,
        "\\Phi": 163,
        "\\gamma": 164,
        "\\Leftarrow": 165,
        "\u221a": 166,
        "\\xi": 167,
        "\u4eba": 168,
        "\u79cd": 169,
        "\\sum": 170,
        "\\sigma": 171,
        "\\epsilon": 172,
        "\u5206": 173,
        "\\Leftrightarrow": 174,
        "\\leftarrow": 175,
        "\u5468": 176,
        "\\phi": 177,
        "\\eta": 178,
        "\\mid": 179,
        "\u7b2c": 180,
        "\\forall": 181,
        "\\omega": 182,
        "\u6b21": 183,
        "\u6ee1": 184,
        "\u8db3": 185,
        "\\zeta": 186,
        "\\ddot": 187,
        "\u65b9": 188,
        "\u6cd5": 189,
        "\\tau": 190,
        "\u9879": 191,
        "\\varnothing": 192,
        "\u7ec4": 193,
        "\u7684": 194,
        "\u56e0": 195,
        "\u6570": 196,
        "\u5c0f": 197,
        "\\Gamma": 198,
        "\\bigcirc": 199,
        "\u89e3": 200,
        "\u539f": 201,
        "\u5f0f": 202,
        "\u8d1f": 203,
        "\\supset": 204,
        "\u5373": 205,
        "\u662f": 206,
        "\"": 207,
        "\\mathop": 208,
        "\\limits": 209,
        "\u65f6": 210,
        "\u660e": 211,
        "\u5143": 212,
        "\u9875": 213,
        "\u5e74": 214,
        "\u5929": 215,
        "\u7532": 216,
        "\u4e59": 217,
        "\u4e19": 218,
        "\u5c06": 219,
        "\u4ee3": 220,
        "\u5165": 221,
        "\u5f97": 222,
        "\u4e3a": 223,
        "\u8be5": 224,
        "\u81ea": 225,
        "\u7136": 226,
        "\u7b54": 227,
        "\\vdots": 228,
        "\u5927": 229,
        "\u6700": 230,
        "\\delta": 231,
        "\u6240": 232,
        "\u4ee5": 233,
        "\u516c": 234,
        "\u500d": 235,
        "\u672c": 236,
        "\u628a": 237,
        "\u888b": 238
    },
    "id_to_token": {
        "0": "<PAD>",
        "1": "<SOS>",
        "2": "<EOS>",
        "3": "<UNK>",
        "4": "S",
        "5": "i",
        "6": "n",
        "7": "\\angle",
        "8": "C",
        "9": "D",
        "10": "B",
        "11": "=",
        "12": "\\sin",
        "13": "E",
        "14": "A",
        "15": "2",
        "16": "4",
        "17": "6",
        "18": "3",
        "19": "7",
        "20": "-",
        "21": "5",
        "22": "m",
        "23": "\\vert",
        "24": "\\textcircled",
        "25": "{",
        "26": "}",
        "27": "x",
        "28": "\\cdot",
        "29": "\\frac",
        "30": "1",
        "31": "0",
        "32": ".",
        "33": "\\Delta",
        "34": "\\cong",
        "35": "(",
        "36": ")",
        "37": ",",
        "38": "8",
        "39": "+",
        "40": "\u3001",
        "41": ">",
        "42": "y",
        "43": "_",
        "44": "9",
        "45": "W",
        "46": "P",
        "47": "t",
        "48": "s",
        "49": "J",
        "50": "^",
        "51": "\\sqrt",
        "52": "\\overline",
        "53": "F",
        "54": "N",
        "55": "\\times",
        "56": "a",
        "57": "\\div",
        "58": "k",
        "59": "g",
        "60": "b",
        "61": "c",
        "62": "M",
        "63": "[",
        "64": "]",
        "65": "<",
        "66": "\\",
        "67": "%",
        "68": "O",
        "69": "\\tan",
        "70": "\\dot",
        "71": "\\cos",
        "72": "\\alpha",
        "73": "\\circ",
        "74": "\\boxed",
        "75": "\\therefore",
        "76": "\\pi",
        "77": "\\cdots",
        "78": "\\leq",
        "79": "\\varphi",
        "80": "\\pm",
        "81": "\\Rightarrow",
        "82": "\\in",
        "83": "G",
        "84": "\\geq",
        "85": "\\rho",
        "86": "V",
        "87": "/",
        "88": "\\bot",
        "89": ":",
        "90": "\\square",
        "91": "Q",
        "92": "h",
        "93": "\\arcsin",
        "94": "\\beta",
        "95": "w",
        "96": "\\overrightarrow",
        "97": "U",
        "98": "u",
        "99": "\\xlongequal",
        "100": "\\uparrow",
        "101": "\\because",
        "102": ";",
        "103": "r",
        "104": "R",
        "105": "I",
        "106": "\\Omega",
        "107": "q",
        "108": "\\prime",
        "109": "\\theta",
        "110": "\\ast",
        "111": "H",
        "112": "f",
        "113": "e",
        "114": "v",
        "115": "d",
        "116": "L",
        "117": "\\widehat",
        "118": "\\approx",
        "119": "K",
        "120": "o",
        "121": "\\min",
        "122": "\\ln",
        "123": "l",
        "124": "\\infty",
        "125": "T",
        "126": "X",
        "127": "\\max",
        "128": "\\rightarrow",
        "129": "p",
        "130": "\\lambda",
        "131": "\\rightleftharpoons",
        "132": "\\arccos",
        "133": "\u3002",
        "134": "\\geqslant",
        "135": "Z",
        "136": "z",
        "137": "\\downarrow",
        "138": "\\cot",
        "139": "\\neq",
        "140": "\u6216",
        "141": "\\int",
        "142": "\\sim",
        "143": "\\log",
        "144": "\u6c42",
        "145": "\u548c",
        "146": "\\lim",
        "147": "\u884c",
        "148": "\u4e2a",
        "149": "!",
        "150": "j",
        "151": "\\arctan",
        "152": "\\mu",
        "153": "\\varepsilon",
        "154": "\\cap",
        "155": "Y",
        "156": "\\equiv",
        "157": "\\partial",
        "158": "\\lg",
        "159": "?",
        "160": "\\Lambda",
        "161": "\\xrightarrow",
        "162": "\\cup",
        "163": "\\Phi",
        "164": "\\gamma",
        "165": "\\Leftarrow",
        "166": "\u221a",
        "167": "\\xi",
        "168": "\u4eba",
        "169": "\u79cd",
        "170": "\\sum",
        "171": "\\sigma",
        "172": "\\epsilon",
        "173": "\u5206",
        "174": "\\Leftrightarrow",
        "175": "\\leftarrow",
        "176": "\u5468",
        "177": "\\phi",
        "178": "\\eta",
        "179": "\\mid",
        "180": "\u7b2c",
        "181": "\\forall",
        "182": "\\omega",
        "183": "\u6b21",
        "184": "\u6ee1",
        "185": "\u8db3",
        "186": "\\zeta",
        "187": "\\ddot",
        "188": "\u65b9",
        "189": "\u6cd5",
        "190": "\\tau",
        "191": "\u9879",
        "192": "\\varnothing",
        "193": "\u7ec4",
        "194": "\u7684",
        "195": "\u56e0",
        "196": "\u6570",
        "197": "\u5c0f",
        "198": "\\Gamma",
        "199": "\\bigcirc",
        "200": "\u89e3",
        "201": "\u539f",
        "202": "\u5f0f",
        "203": "\u8d1f",
        "204": "\\supset",
        "205": "\u5373",
        "206": "\u662f",
        "207": "\"",
        "208": "\\mathop",
        "209": "\\limits",
        "210": "\u65f6",
        "211": "\u660e",
        "212": "\u5143",
        "213": "\u9875",
        "214": "\u5e74",
        "215": "\u5929",
        "216": "\u7532",
        "217": "\u4e59",
        "218": "\u4e19",
        "219": "\u5c06",
        "220": "\u4ee3",
        "221": "\u5165",
        "222": "\u5f97",
        "223": "\u4e3a",
        "224": "\u8be5",
        "225": "\u81ea",
        "226": "\u7136",
        "227": "\u7b54",
        "228": "\\vdots",
        "229": "\u5927",
        "230": "\u6700",
        "231": "\\delta",
        "232": "\u6240",
        "233": "\u4ee5",
        "234": "\u516c",
        "235": "\u500d",
        "236": "\u672c",
        "237": "\u628a",
        "238": "\u888b"
    }
}